[NoCoverage] BlockStatement
src/App.tsx:4:31
 import React from "react";
 import GameWithHooks from "./modules/GameWithHooks";
 
-export default function App() {
-  return (
-    <>
-      <GameWithHooks />
-    </>
-  );
-}
+export default function App() {}
 
