[Killed] BlockStatement
src/helpers/CellsManipulator.ts:11:3
 export function getNeigboursItems([y, x]: Coords): Record<
   string,
   [number, number]
-> {
-  return {
-    top: [y - 1, x],
-    topRight: [y - 1, x + 1],
-    right: [y, x + 1],
-    rightBottom: [y + 1, x + 1],
-    bottom: [y + 1, x],
-    bottomLeft: [y + 1, x - 1],
-    left: [y, x - 1],
-    leftTop: [y - 1, x - 1],
-  };
-}
+> {}
 
 /**
killedBy: Check neighbours selectors With [0,0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"bottom": [1, 0], "bottomLeft": [1, -1], "left": [0, -1], "leftTop": [-1, -1], "right": [0, 1], "rightBottom": [1, 1], "top": [-1, 0], "topRight": [-1, 1]}
Received: undefined

[Killed] ArrayDeclaration
src/helpers/CellsManipulator.ts:13:10
   [number, number]
 > {
   return {
-    top: [y - 1, x],
+    top: [],
     topRight: [y - 1, x + 1],
     right: [y, x + 1],
killedBy: Check neighbours selectors With [0,0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

@@ -21,14 +21,11 @@
    ],
    "rightBottom": Array [

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:30:78
  * @param {Field} field
  * @returns {boolean}
  */
-export function checkItemInField([y, x]: Coords, { length }: Field): boolean {
-  return y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
-}
+export function checkItemInField([y, x]: Coords, { length }: Field): boolean {}
 
 /**
killedBy: useGame test cases GameWithHooks test cases Open cell test cases OnClick with OnChangeGameLevel and OnReset Check click to the cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [0]

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:31:20
  * @returns {boolean}
  */
 export function checkItemInField([y, x]: Coords, { length }: Field): boolean {
-  return y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  return y >= 0 && x > 0 && length - y > 0 && length - x > 0;
 }
 
killedBy: checkItemInField test Simple cases In x and y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:31:10
  * @returns {boolean}
  */
 export function checkItemInField([y, x]: Coords, { length }: Field): boolean {
-  return y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  return y > 0 && x >= 0 && length - y > 0 && length - x > 0;
 }
 
killedBy: checkItemInField test Simple cases In x and y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:46:21
   for (const [y, x] of Object.values(items)) {
     if (checkItemInField([y, x], field)) {
       const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
+      if (cell < 8) {}
     }
   }
killedBy: Check Increment Neibours Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:74:37
     throw new Error("Game Over");
   }
 
-  if (gameCell === CellState.empty) {
-    playerField[y][x] = gameCell;
-
-    const items = getNeigboursItems(coords);
-
-    for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
-        const [y, x] = coords;
-
-        const gameCell = gameField[y][x];
-        const playerCell = playerField[y][x];
-
-        if (gameCell === CellState.hidden && playerCell !== CellState.bomb) {
-          playerField = openCell(coords, playerField, gameField);
-        }
-
-        if (gameCell < CellState.bomb) {
-          playerField[y][x] = gameCell;
-        }
-      }
-    }
-  }
+  if (gameCell === CellState.empty) {}
 
   playerField[y][x] = gameCell;
killedBy: useGame test cases GameWithHooks test cases Open cell test cases OnClick with OnChangeGameLevel and OnReset Check click to the cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [0]

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:79:48
 
     const items = getNeigboursItems(coords);
 
-    for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
-        const [y, x] = coords;
-
-        const gameCell = gameField[y][x];
-        const playerCell = playerField[y][x];
-
-        if (gameCell === CellState.hidden && playerCell !== CellState.bomb) {
-          playerField = openCell(coords, playerField, gameField);
-        }
-
-        if (gameCell < CellState.bomb) {
-          playerField[y][x] = gameCell;
-        }
-      }
-    }
+    for (const coords of Object.values(items)) {}
   }
 
killedBy: Open cell action Open cell with number Open empty cell, simple 3x3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      10,

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:80:48
     const items = getNeigboursItems(coords);
 
     for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
-        const [y, x] = coords;
-
-        const gameCell = gameField[y][x];
-        const playerCell = playerField[y][x];
-
-        if (gameCell === CellState.hidden && playerCell !== CellState.bomb) {
-          playerField = openCell(coords, playerField, gameField);
-        }
-
-        if (gameCell < CellState.bomb) {
-          playerField[y][x] = gameCell;
-        }
-      }
+      if (checkItemInField(coords, gameField)) {}
     }
   }
killedBy: useGame test cases GameWithHooks test cases Open cell test cases OnClick with OnChangeGameLevel and OnReset Check click to the cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [0]

[NoCoverage] BlockStatement
src/helpers/CellsManipulator.ts:86:77
         const gameCell = gameField[y][x];
         const playerCell = playerField[y][x];
 
-        if (gameCell === CellState.hidden && playerCell !== CellState.bomb) {
-          playerField = openCell(coords, playerField, gameField);
-        }
+        if (gameCell === CellState.hidden && playerCell !== CellState.bomb) {}
 
         if (gameCell < CellState.bomb) {

[Timeout] LogicalOperator
src/helpers/CellsManipulator.ts:86:13
         const gameCell = gameField[y][x];
         const playerCell = playerField[y][x];
 
-        if (gameCell === CellState.hidden && playerCell !== CellState.bomb) {
+        if (gameCell === CellState.hidden || playerCell !== CellState.bomb) {
           playerField = openCell(coords, playerField, gameField);
         }

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:90:13
           playerField = openCell(coords, playerField, gameField);
         }
 
-        if (gameCell < CellState.bomb) {
+        if (false) {
           playerField[y][x] = gameCell;
         }
killedBy: useGame test cases GameWithHooks test cases Open cell test cases OnClick with OnChangeGameLevel and OnReset Check click to the cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [0]

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:90:13
           playerField = openCell(coords, playerField, gameField);
         }
 
-        if (gameCell < CellState.bomb) {
+        if (gameCell >= CellState.bomb) {
           playerField[y][x] = gameCell;
         }
killedBy: useGame test cases GameWithHooks test cases Open cell test cases OnClick with OnChangeGameLevel and OnReset Check click to the cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [0]
