[Killed] BlockStatement
src/hooks/useMouseDown.ts:10:6
   boolean,
   SetMouseDownStatus,
   SetMouseUpStatus,
-] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  const onMouseDown = useCallback(
-    () => setMouseDown(true),
-    // Stryker disable next-line ArrayDeclaration
-    []
-  );
-  const onMouseUp = useCallback(
-    () => setMouseDown(false),
-    // Stryker disable next-line ArrayDeclaration
-    []
-  );
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+] => {};
 
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.
