[Killed] BlockStatement
src/components/Grid/Cell.tsx:14:55
   onContextMenu: (coords: Coords) => void;
 }
 
-export function isActiveCell(cell: CellType): boolean {
-  return [CellState.hidden, CellState.flag, CellState.weakFlag].includes(cell);
-}
+export function isActiveCell(cell: CellType): boolean {}
 
 export default function Cell({ children, coords, ...rest }: CellProps) {
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]

[Killed] BlockStatement
src/components/Grid/Cell.tsx:21:25
 export default function Cell({ children, coords, ...rest }: CellProps) {
   const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
 
-  const onClick = () => {
-    rest.onClick(coords);
-  };
+  const onClick = () => {};
 
   const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
killedBy: GameWithHooks test cases Render behaviour Cell click works fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Grid/Cell.tsx:25:66
     rest.onClick(coords);
   };
 
-  const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
-    elem.preventDefault();
-
-    if (isActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {};
 
   const props = {
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:60:30
 }
 
 function ComponentsMap({ children, ...rest }: ComponentsMapProp) {
-  const nonActiveCellProps = {
-    onContextMenu: rest.onContextMenu,
-    "data-testid": rest["data-testid"],
-    role: rest.role,
-  };
+  const nonActiveCellProps = {};
 
   switch (children) {
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 2
+ Received  + 0

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:62:25
 function ComponentsMap({ children, ...rest }: ComponentsMapProp) {
   const nonActiveCellProps = {
     onContextMenu: rest.onContextMenu,
-    "data-testid": rest["data-testid"],
+    "data-testid": rest[""],
     role: rest.role,
   };
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 0

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:67:5
   };
 
   switch (children) {
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <Bomb />
-        </BombFrame>
-      );
+    case CellState.bomb:
 
     case CellState.flag:
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 10`

- Snapshot  - 2
+ Received  + 2

  <DocumentFragment>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:74:5
         </BombFrame>
       );
 
-    case CellState.flag:
-      return (
-        <ClosedFrame {...rest}>
-          <Flag />
-        </ClosedFrame>
-      );
+    case CellState.flag:
 
     case CellState.weakFlag:
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 12`

- Snapshot  - 1
+ Received  + 1

@@ -3,9 +3,9 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:81:5
         </ClosedFrame>
       );
 
-    case CellState.weakFlag:
-      return (
-        <ClosedFrame {...rest}>
-          <WeakFlag />
-        </ClosedFrame>
-      );
+    case CellState.weakFlag:
 
     case CellState.hidden:
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 13`

- Snapshot  - 3
+ Received  + 1

@@ -2,10 +2,8 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:88:5
         </ClosedFrame>
       );
 
-    case CellState.hidden:
-      return <ClosedFrame {...rest}>{children}</ClosedFrame>;
+    case CellState.hidden:
 
     default:
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 4
+ Received  + 4

@@ -85,32 +85,32 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:91:5
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
 
-    default:
-      return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
+    default:
   }
 }
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 9
+ Received  + 1

- <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:110:19
   height: 20px;
   background-color: #d1d1d1;
   border: 5px solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? "transparent" : "white #9e9e9e #9e9e9e white"};
+  border-color: ${() => undefined};
   transition: all 0.2s linear;
   color: transparent;
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 4
+ Received  + 4

@@ -85,32 +85,32 @@

[Killed] BooleanLiteral
src/components/Grid/Cell.tsx:110:34
   height: 20px;
   background-color: #d1d1d1;
   border: 5px solid transparent;
-  border-color: ${({ mouseDown = false }) =>
+  border-color: ${({ mouseDown = true }) =>
     mouseDown ? "transparent" : "white #9e9e9e #9e9e9e white"};
   transition: all 0.2s linear;
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:126:6
   1: "#2a48ec",
   2: "#2bb13d",
   3: "#ec6561",
-  4: "#23db7",
+  4: "",
   5: "#a6070f",
   6: "#e400af",
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 5`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:127:6
   2: "#2bb13d",
   3: "#ec6561",
   4: "#23db7",
-  5: "#a6070f",
+  5: "",
   6: "#e400af",
   7: "#906a02",
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 6`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:137:42
   12: transparent,
 };
 
-const RevealedFrame = styled(ClosedFrame)`
-  border-color: #ddd;
-  cursor: default;
-  color: ${({ children }) =>
-    children === 0 ? transparent : colors[children as CellType] ?? transparent};
-
-  &:hover {
-    filter: brightness(1.1);
-  }
-`;
+const RevealedFrame = styled(ClosedFrame)``;
 
 const Bomb = styled.div`
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:140:12
 const RevealedFrame = styled(ClosedFrame)`
   border-color: #ddd;
   cursor: default;
-  color: ${({ children }) =>
-    children === 0 ? transparent : colors[children as CellType] ?? transparent};
+  color: ${() => undefined};
 
   &:hover {
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:141:5
   border-color: #ddd;
   cursor: default;
   color: ${({ children }) =>
-    children === 0 ? transparent : colors[children as CellType] ?? transparent};
+    false ? transparent : colors[children as CellType] ?? transparent};
 
   &:hover {
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:141:5
   border-color: #ddd;
   cursor: default;
   color: ${({ children }) =>
-    children === 0 ? transparent : colors[children as CellType] ?? transparent};
+    true ? transparent : colors[children as CellType] ?? transparent};
 
   &:hover {
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 2`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
