[Killed] BlockStatement
src/components/Grid/Grid.tsx:14:64
   onContextMenu: (coords: Coords) => void;
 }
 
-export default function Grid({ children, ...rest }: GridProps) {
-  return (
-    <Wrapper size={children.length}>
-      {children.map((row, y) =>
-        row.map((cell, x) => (
-          <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-            {cell}
-          </Cell>
-        ))
-      )}
-    </Wrapper>
-  );
-}
+export default function Grid({ children, ...rest }: GridProps) {}
 
 interface WrapperProps {
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 33
+ Received  +  0

@@ -80,41 +80,8 @@

[Killed] ArrayDeclaration
src/components/Grid/Grid.tsx:19:51
     <Wrapper size={children.length}>
       {children.map((row, y) =>
         row.map((cell, x) => (
-          <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
+          <Cell key={`${y}_${x}_${cell}`} coords={[]} {...rest}>
             {cell}
           </Cell>
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 4
+ Received  + 4

@@ -86,32 +86,32 @@

[Survived] StringLiteral
src/components/Grid/Grid.tsx:19:22
     <Wrapper size={children.length}>
       {children.map((row, y) =>
         row.map((cell, x) => (
-          <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
+          <Cell key={``} coords={[y, x]} {...rest}>
             {cell}
           </Cell>

[Killed] StringLiteral
src/components/Grid/Grid.tsx:32:41
   size: number;
 }
 
-const Wrapper = styled.div<WrapperProps>`
-  display: grid;
-  grid-template-columns: repeat(${({ size }) => size}, auto);
-  width: max-content;
-  padding: 10px;
-`;
+const Wrapper = styled.div<WrapperProps>``;
 
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -81,11 +81,11 @@
