[Killed] BlockStatement
src/components/Scoreboard/Counter.tsx:8:61
   children: string;
 }
 
-export default function Counter({ children }: CounterProps) {
-  return <Frame>{children}</Frame>;
-}
+export default function Counter({ children }: CounterProps) {}
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 10
+ Received  +  0

@@ -37,15 +37,10 @@
