[Killed] BlockStatement
src/components/Scoreboard/Level.tsx:10:67
   onChange: (event: React.ChangeEvent<HTMLSelectElement>) => void;
 }
 
-export default function Level({ children, ...props }: LevelProps) {
-  return (
-    <Select {...props}>
-      {children.map((item: string) => (
-        <Option value={item} key={React.useId()}>
-          {item}
-        </Option>
-      ))}
-    </Select>
-  );
-}
+export default function Level({ children, ...props }: LevelProps) {}
 
 const Select = styled.select`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 22
+ Received  +  0

@@ -42,32 +42,10 @@

[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:13:21
 export default function Level({ children, ...props }: LevelProps) {
   return (
     <Select {...props}>
-      {children.map((item: string) => (
-        <Option value={item} key={React.useId()}>
-          {item}
-        </Option>
-      ))}
+      {children.map(() => undefined)}
     </Select>
   );
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 20
+ Received  +  1

@@ -44,30 +44,11 @@
