[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:10:56
   onReset: () => void;
 }
 
-export default function Reset({ onReset }: ResetProps) {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  const events = {
-    onMouseDown: onMouseDown,
-    onMouseUp: onMouseUp,
-    onMouseLeave: onMouseUp,
-    onClick: onReset,
-  };
-
-  return <Button {...events}>{mouseDown ? "😐" : "😌"}</Button>;
-}
+export default function Reset({ onReset }: ResetProps) {}
 
 const Button = styled.button`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 5
+ Received  + 0

@@ -64,15 +64,10 @@
