[Killed] BlockStatement
src/components/Scoreboard/Scoreboard.tsx:24:21
   defaultLevel,
   onChangeLevel: onChange,
   time,
-}: ScoreboardProps) {
-  return (
-    <Wrapper>
-      <Counter>{time}</Counter>
-      <Level value={defaultLevel} onChange={onChange}>
-        {levels}
-      </Level>
-      <Reset onReset={onReset} />
-      <Counter>{bombs}</Counter>
-    </Wrapper>
-  );
-}
+}: ScoreboardProps) {}
 
 const Wrapper = styled.div`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 41
+ Received  +  0

@@ -35,51 +35,10 @@
