[Killed] BlockStatement
src/components/Top/Top.tsx:9:77
 
 export type TopComponentType = LegendProps & GameNameProps;
 
-export default function Top({ children, ...legendProps }: TopComponentType) {
-  return (
-    <Header>
-      <GameName>{children}</GameName>
-      <Legend {...legendProps} />
-    </Header>
-  );
-}
+export default function Top({ children, ...legendProps }: TopComponentType) {}
 
 const Header = styled.header`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 31
+ Received  +  0

@@ -1,40 +1,9 @@
