[Killed] BlockStatement
src/components/Top/Legend.tsx:14:17
   feature,
   firstAction,
   secondAction,
-}: LegendProps) {
-  return (
-    <Parent>
-      <strong>{feature}: </strong>
-      <FlagComboParent>
-        <FirstAction>{firstAction}</FirstAction> +{" "}
-        <SecondAction>{secondAction}</SecondAction>
-      </FlagComboParent>
-    </Parent>
-  );
-}
+}: LegendProps) {}
 
 const FlagComboParent = styled.code`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 22
+ Received  +  0

@@ -8,32 +8,10 @@
