[Killed] BlockStatement
src/helpers/Field.ts:31:10
 export function generateFieldWithDefaultState(
   size: number,
   state: Cell = CellState.empty
-): Field {
-  return new Array(size).fill(null).map(() => new Array(size).fill(state));
-}
+): Field {}
 
 export function fieldGenerator(size: number, probability: number): Field {
killedBy: Field Generator generateFieldWithDefaultState tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] ArrowFunction
src/helpers/Field.ts:32:41
   size: number,
   state: Cell = CellState.empty
 ): Field {
-  return new Array(size).fill(null).map(() => new Array(size).fill(state));
+  return new Array(size).fill(null).map(() => undefined);
 }
 
killedBy: Field Generator generateFieldWithDefaultState tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] ArrayDeclaration
src/helpers/Field.ts:32:47
   size: number,
   state: Cell = CellState.empty
 ): Field {
-  return new Array(size).fill(null).map(() => new Array(size).fill(state));
+  return new Array(size).fill(null).map(() => new Array().fill(state));
 }
 
killedBy: Field Generator generateFieldWithDefaultState tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] ConditionalExpression
src/helpers/Field.ts:36:7
 }
 
 export function fieldGenerator(size: number, probability: number): Field {
-  if (probability < 0 || probability > 1) {
+  if (true) {
     throw new Error("Probability must be between 0 and 1");
   }
killedBy: Field Generator Simple cases Smalltest possible field without mine
statusReason: Error: Probability must be between 0 and 1

[Killed] EqualityOperator
src/helpers/Field.ts:36:7
 }
 
 export function fieldGenerator(size: number, probability: number): Field {
-  if (probability < 0 || probability > 1) {
+  if (probability >= 0 || probability > 1) {
     throw new Error("Probability must be between 0 and 1");
   }
killedBy: useGame test cases Render hook by default
statusReason: Error: Probability must be between 0 and 1

[Killed] BlockStatement
src/helpers/Field.ts:45:34
 
   const result: Field = generateFieldWithDefaultState(size);
 
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-
-        incrementNeibours([y, x], result);
-
-        restCellsWithBombs--;
-      }
-
-      unprocessedCells--;
-    }
-  }
+  for (let y = 0; y < size; y++) {}
 
   return result;
killedBy: useGame test cases Render hook by default
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 0
Received array:  []

[Killed] ArithmeticOperator
src/helpers/Field.ts:47:11
 
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (restCellsWithBombs * unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
 
killedBy: Field Generator Simple cases Real game field size = 10x10 with 1/4 mined cells (~25 mines)
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "99999999999999999999"

[Killed] ConditionalExpression
src/helpers/Field.ts:47:11
 
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (true) {
         result[y][x] = CellState.bomb;
 
killedBy: useGame test cases Render hook by default
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 81
Received array:  [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, …]

[Killed] UpdateOperator
src/helpers/Field.ts:52:9
 
         incrementNeibours([y, x], result);
 
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
 
killedBy: useGame test cases Render hook by default
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 42
Received array:  [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, …]

[Killed] UpdateOperator
src/helpers/Field.ts:55:7
         restCellsWithBombs--;
       }
 
-      unprocessedCells--;
+      unprocessedCells++;
     }
   }
killedBy: useGame test cases Render hook by default
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 5
Received array:  [9, 9, 9, 9, 9]
