[Killed] LogicalOperator
src/modules/GameWithHooks/GameWithHooks.tsx:41:10
           bombs={String(bombs)}
           onReset={onReset}
         />
-        {isGameOver && <GameOver isWin={isWin} onClick={onReset} />}
+        {isGameOver || <GameOver isWin={isWin} onClick={onReset} />}
         <Grid onClick={onClick} onContextMenu={() => null}>
           {playerField}
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 5
+ Received  + 0

@@ -76,15 +76,10 @@

[Killed] ConditionalExpression
src/modules/GameWithHooks/GameWithHooks.tsx:41:10
           bombs={String(bombs)}
           onReset={onReset}
         />
-        {isGameOver && <GameOver isWin={isWin} onClick={onReset} />}
+        {true}
         <Grid onClick={onClick} onContextMenu={() => null}>
           {playerField}
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 5
+ Received  + 0

@@ -76,15 +76,10 @@

[Survived] ArrowFunction
src/modules/GameWithHooks/GameWithHooks.tsx:42:48
           onReset={onReset}
         />
         {isGameOver && <GameOver isWin={isWin} onClick={onReset} />}
-        <Grid onClick={onClick} onContextMenu={() => null}>
+        <Grid onClick={onClick} onContextMenu={() => undefined}>
           {playerField}
         </Grid>
