[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:28:54
 export default function useGame(): ReturnType {
   const [level, setLevel] = useState<LevelNames>("beginner");
 
-  const [isGameOver, setIsGameOver] = React.useState(false);
+  const [isGameOver, setIsGameOver] = React.useState(true);
   const [isWin, setIsWin] = React.useState(false);
 
killedBy: useGame test cases GameWithHooks test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "isGameOver": false,

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:29:44
   const [level, setLevel] = useState<LevelNames>("beginner");
 
   const [isGameOver, setIsGameOver] = React.useState(false);
-  const [isWin, setIsWin] = React.useState(false);
+  const [isWin, setIsWin] = React.useState(true);
 
   const [size, bombs] = GameSettings[level];
killedBy: useGame test cases GameWithHooks test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Object {
    "isGameOver": false,

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:41:39
     fieldGenerator(size, bombs / (size * size))
   );
 
-  const onClick = (coords: Coords) => {
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-    } catch (error) {
-      setPlayerField([...gameField]);
-      setIsGameOver(true);
-    }
-  };
+  const onClick = (coords: Coords) => {};
 
   const resetHandler = ([size, bombs]: [number, number]) => {
killedBy: useGame test cases GameWithHooks test cases Open cell test cases Click to the non-empty cells area
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:42:9
   );
 
   const onClick = (coords: Coords) => {
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-    } catch (error) {
+    try {} catch (error) {
       setPlayerField([...gameField]);
       setIsGameOver(true);
killedBy: useGame test cases GameWithHooks test cases Open cell test cases Click to the non-empty cells area
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:45:21
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
       setPlayerField([...newPlayerField]);
-    } catch (error) {
-      setPlayerField([...gameField]);
-      setIsGameOver(true);
-    }
+    } catch (error) {}
   };
 
killedBy: useGame test cases GameWithHooks test cases Open cell test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:46:22
       const newPlayerField = openCell(coords, playerField, gameField);
       setPlayerField([...newPlayerField]);
     } catch (error) {
-      setPlayerField([...gameField]);
+      setPlayerField([]);
       setIsGameOver(true);
     }
killedBy: useGame test cases GameWithHooks test cases Open cell test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 27
Received length: 0
Received array:  []

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:47:21
       setPlayerField([...newPlayerField]);
     } catch (error) {
       setPlayerField([...gameField]);
-      setIsGameOver(true);
+      setIsGameOver(false);
     }
   };
killedBy: useGame test cases GameWithHooks test cases Open cell test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:51:61
     }
   };
 
-  const resetHandler = ([size, bombs]: [number, number]) => {
-    const newGameField = fieldGenerator(size, bombs / (size * size));
-    const newPlayerField = generateFieldWithDefaultState(
-      size,
-      CellState.hidden
-    );
-
-    setGameField([...newGameField]);
-    setPlayerField([...newPlayerField]);
-    setIsGameOver(false);
-    setIsWin(false);
-  };
+  const resetHandler = ([size, bombs]: [number, number]) => {};
 
   const onChangeLevel = (level: LevelNames) => {
killedBy: useGame test cases GameWithHooks test cases Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:52:56
   };
 
   const resetHandler = ([size, bombs]: [number, number]) => {
-    const newGameField = fieldGenerator(size, bombs / (size * size));
+    const newGameField = fieldGenerator(size, bombs / (size / size));
     const newPlayerField = generateFieldWithDefaultState(
       size,
killedBy: useGame test cases onReset game handler
statusReason: Error: Probability must be between 0 and 1

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:52:47
   };
 
   const resetHandler = ([size, bombs]: [number, number]) => {
-    const newGameField = fieldGenerator(size, bombs / (size * size));
+    const newGameField = fieldGenerator(size, bombs * (size * size));
     const newPlayerField = generateFieldWithDefaultState(
       size,
killedBy: useGame test cases onReset game handler
statusReason: Error: Probability must be between 0 and 1

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:59:20
     );
 
     setGameField([...newGameField]);
-    setPlayerField([...newPlayerField]);
+    setPlayerField([]);
     setIsGameOver(false);
     setIsWin(false);
killedBy: useGame test cases GameWithHooks test cases Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 0
Received array:  []

[Killed] ArrowFunction
src/modules/GameWithHooks/useGame.ts:70:19
     resetHandler(newSettings);
   };
 
-  const onReset = () => resetHandler([size, bombs]);
+  const onReset = () => undefined;
 
   return {
killedBy: useGame test cases GameWithHooks test cases Open cell test cases OnClick with OnChangeGameLevel and OnReset onReset game handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 81
Received length: 76
Received array:  [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, …]
