[Killed] ArrowFunction
src/components/Game/GameArea.tsx:11:44
   children: ReactNode;
 }
 
-export const GameArea: FC<GameAreaProps> = ({ children }) => (
-  <Frame>{children}</Frame>
-);
+export const GameArea: FC<GameAreaProps> = () => undefined;
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 83
+ Received  +  0

@@ -31,90 +31,7 @@
