[Killed] ArrowFunction
src/components/Game/Wrapper.tsx:11:42
   children: ReactNode;
 }
 
-export const Wrapper: FC<WrapperProps> = ({ children }) => (
-  <Frame>{children}</Frame>
-);
+export const Wrapper: FC<WrapperProps> = () => undefined;
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 120
+ Received  +   1

- <DocumentFragment>
