[Killed] StringLiteral
src/modules/GameSettings.ts:4:70
 export const GameLevels = ["beginner", "intermediate", "expert"] as const;
 
 export type LevelNames = (typeof GameLevels)[number];
-export const levelNames: LevelNames[] = ["beginner", "intermediate", "expert"];
+export const levelNames: LevelNames[] = ["beginner", "intermediate", ""];
 
 /**
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 4
+ Received  + 2

@@ -59,14 +59,12 @@
