[NoCoverage] BlockStatement
src/App.tsx:4:19
 import React from "react";
 import GameWithHooks from "./modules/GameWithHooks";
 
-const App = () => {
-  return (
-    <>
-      <GameWithHooks />
-    </>
-  );
-};
+const App = () => {};
 
 export default App;
